{
  "backend/main.mo": "Main backend actor defining types (Availability, Booking, Laborer, Service) and implementing laborer profile management, booking creation/updates, and user profile operations with access control integration.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (authentication, profile management, discovery, booking, dashboard) to their corresponding files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their purpose, including routing, hooks, components, pages, and styling with warm earth-tone color system.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark modes with warm earth tones (amber, orange, stone) and custom design tokens.",
  "frontend/index.html": "HTML entry point for the Labor Booking App with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with routes for landing, profile, discovery, booking, and dashboard pages, wrapped in Layout with ProfileSetupModal for new users.",
  "frontend/src/components/Layout.tsx": "Responsive layout component with sticky header, navigation links (desktop and mobile), authentication button, and footer with LaborConnect branding and Briefcase icon.",
  "frontend/src/components/ProfileSetupModal.tsx": "Non-dismissible modal dialog prompting authenticated users without profiles to enter their name, using useSaveCallerUserProfile mutation for submission.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing backend actor creation with identity-based authentication, admin token initialization, and automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend API calls including user profiles, laborer data, bookings, and location-based searches with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including sidebar, chart, and UI component styling tokens.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BookingsDashboard.tsx": "Dashboard displaying incoming and outgoing bookings with status management, filtering by user principal, and action buttons for confirming/cancelling bookings.",
  "frontend/src/pages/BookingSuccessPage.tsx": "Success confirmation page displayed after booking submission with navigation options to discover more laborers or view bookings dashboard.",
  "frontend/src/pages/CreateBookingPage.tsx": "Form page for creating a new booking with a specific laborer, collecting service type, date/time, duration, and location details before submission.",
  "frontend/src/pages/DiscoveryPage.tsx": "Discovery page component that allows authenticated users to search for laborers by location, displaying results in cards with availability status, skills, services, and contact information.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component with hero section and features overview, showing authentication-dependent CTAs and explaining how the labor booking platform works.",
  "frontend/src/pages/ProfilePage.tsx": "Profile management page where authenticated laborers can view and edit their profile information including name, skills, services, location, contact details, and availability status.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH), container settings, border radius variables, animations, and typography/container-queries plugins.",
  "project_state.json": "Project state file documenting a labor booking marketplace app with existing features for authentication, profile management, discovery, and booking, plus pending feature requests."
}