{
  "backend/main.mo": "Main actor defining the labor booking platform backend with types for Laborer, Booking, Service, and Availability; includes CRUD operations for laborers and bookings, mobile number validation, auto-generated labor IDs, and access control integration.",
  "backend/migration.mo": "Migration module that transforms old actor state to new schema by adding laborId and mobileNumber fields to existing laborers, using principal-based IDs and default mobile numbers for backward compatibility.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features related to mobile number and labor ID display across ProfilePage, DiscoveryPage, BookingDetailPage, and booking query cache invalidation.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend source files, describing their purpose, key features, and implementation details including mobile number handling, labor ID display, and booking workflows.",
  "frontend/index.css": "Global Tailwind CSS styles defining a warm earth-tone OKLCH color system with custom CSS variables for light and dark modes, avoiding blue and purple colors.",
  "frontend/index.html": "HTML entry point for the Labor Booking App with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with all route definitions (landing, profile, discovery, booking, bookings dashboard), Layout wrapper with ProfileSetupModal, and Toaster for notifications.",
  "frontend/src/components/BookingHistorySection.tsx": "Collapsible section component displaying completed and cancelled bookings with toggle functionality, status badges, formatted dates, and clickable cards linking to booking detail pages.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, authentication controls, and mobile menu support. Handles login/logout via Internet Identity and displays navigation links for authenticated users.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name during initial profile setup. Uses a form with validation and prevents closing until submission.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication. Automatically recreates the actor when identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useBookingFilters.ts": "Utility hook providing filtering and sorting functions for booking lists by status and date order.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and auth client lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend data operations including user profiles, laborer profiles, bookings, and their mutations with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming, including light and dark mode color schemes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BookingDetailPage.tsx": "Detailed view page for a single booking showing all information, contact details, and allowing the requester to edit booking details with status-based UI variations.",
  "frontend/src/pages/BookingsDashboard.tsx": "Manages and displays incoming and outgoing bookings with filtering, sorting, and status update capabilities. Includes extensive debug logging for booking classification and principal matching.",
  "frontend/src/pages/BookingSuccessPage.tsx": "Displays a success confirmation page after a booking request is submitted, with navigation options to find more laborers or view bookings dashboard.",
  "frontend/src/pages/CreateBookingPage.tsx": "Form page for creating a new booking request for a specific laborer, with validation and detailed logging for debugging the booking creation flow.",
  "frontend/src/pages/DiscoveryPage.tsx": "Search and browse page for finding laborers by location, displaying their availability, skills, services, and contact information with booking navigation.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, feature highlights, and call-to-action buttons for authentication and navigation to main app features.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page for laborers to edit their information including name, skills, services, location, contact details, mobile number, and availability status.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata for a peer-to-peer labor booking marketplace app with known issues around booking service functionality and outgoing bookings not appearing after creation."
}