{
  "backend/main.mo": "Main backend actor defining types (Laborer, Booking, Service, Availability) and implementing laborer profile management, booking creation/retrieval, and access control with authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting three debugging and investigation tasks related to fixing outgoing booking display issues in BookingsDashboard.tsx, including logging, timing, and cache synchronization.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their purpose, key features, and implementation details including routing, queries, UI components, and booking management.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining warm earth-tone palette (amber, orange, stone) for light and dark modes with CSS custom properties.",
  "frontend/index.html": "HTML entry point with root div and module script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all route definitions, Layout wrapper with profile setup modal for new users, and Toaster for notifications.",
  "frontend/src/components/BookingHistorySection.tsx": "Collapsible section component displaying completed and cancelled bookings with status badges, formatted dates, and clickable cards linking to booking detail pages.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, authentication controls, and responsive mobile menu. Handles login/logout via Internet Identity and displays navigation links for authenticated users.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name during initial profile setup. Uses a form with validation and calls the save profile mutation on submit.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on authentication state. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useBookingFilters.ts": "Utility hook providing a function to filter bookings by status and sort them by date (newest or oldest). Returns filtered and sorted booking arrays.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication. Manages login state, identity persistence, and provides login/logout functions with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend data operations including user profiles, laborer profiles, bookings, and booking status updates. Each hook uses the actor from useActor and manages query/mutation state.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming including light and dark mode color schemes. Defines design tokens for colors, borders, and component styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component into the DOM.",
  "frontend/src/pages/BookingDetailPage.tsx": "Detailed view page for a single booking showing requester/provider information, booking details, status, and contact information. Allows editing booking details and displays user profiles with mobile numbers.",
  "frontend/src/pages/BookingsDashboard.tsx": "Manages and displays incoming and outgoing bookings with filtering, sorting, and status update capabilities. Includes extensive debug logging for tracking booking classification and state.",
  "frontend/src/pages/BookingSuccessPage.tsx": "Displays a success confirmation page after a booking request is submitted, with options to find more laborers or view bookings dashboard.",
  "frontend/src/pages/CreateBookingPage.tsx": "Form page for creating a new booking request for a specific laborer, with validation and detailed logging of form submission and laborer data loading.",
  "frontend/src/pages/DiscoveryPage.tsx": "Search and browse page for finding laborers by location, displaying their availability, skills, services, and contact information with booking navigation.",
  "frontend/src/pages/LandingPage.tsx": "Marketing homepage with hero section, feature highlights, and call-to-action buttons for authentication and navigation to main app features.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page for laborers to edit their information including name, skills, services, location, contact details, mobile number, and availability status.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata for a peer-to-peer labor booking marketplace app, documenting existing features, known issues (booking service not working, outgoing bookings not appearing), and architectural notes about laborer identification and core functionality."
}