{
  "backend/main.mo": "Main actor defining the labor booking platform backend with types for Laborer, Booking, Service, and Availability, stable storage using Maps for laborers and user profiles, authorization integration via MixinAuthorization, and public shared functions for CRUD operations on laborers and bookings with permission checks and validation (e.g., 10-digit mobile numbers).",
  "backend/migration.mo": "Migration module that transforms OldActor state to NewActor state by renaming the Service.price field to Service.priceInInr across all laborers in the laborersStore map while preserving all other data structures.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: replacing dollar signs with Indian Rupee symbols (₹) and updating price fields to use INR formatting across frontend pages (ProfilePage, CreateBookingPage, DiscoveryPage).",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend source files, describing components, pages, hooks, and configuration files with details about their functionality, state management, routing, and UI features.",
  "frontend/index.css": "Global CSS file with Tailwind directives and custom CSS variables defining a warm earth-tone color system using OKLCH color space for both light and dark modes, including variables for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/index.html": "HTML entry point for the React application with basic meta tags, title 'Labor Booking App', a root div, and a module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all route definitions (landing, profile, discover, bookings, system-health), a LayoutWrapper that conditionally renders ProfileSetupModal for new users, comprehensive authentication and profile state logging, and Toaster for notifications.",
  "frontend/src/components/BookingHistorySection.tsx": "Collapsible section component displaying a list of bookings (incoming or outgoing) as cards with status badges, date/time, duration, location, and navigation links to booking detail pages, with expand/collapse toggle functionality.",
  "frontend/src/components/Layout.tsx": "Main layout component with navigation header, authentication controls (login/logout), and mobile menu. Handles user authentication state and provides navigation links to discover, profile, bookings, and system health pages.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name during initial profile setup. Uses a mutation hook to save the profile and cannot be dismissed until completed.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useBookingFilters.ts": "Utility hook providing a function to filter bookings by status and sort them by date (newest or oldest first).",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, laborer data, and bookings from the backend canister. Includes hooks for caller-specific queries and general user profile lookups.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a complete design system including colors for light/dark themes, spacing (radius), and chart colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component into the DOM.",
  "frontend/src/pages/BookingDetailPage.tsx": "Displays detailed information for a single booking, including requester and provider profiles, contact details, and allows the requester to edit booking details with save functionality.",
  "frontend/src/pages/BookingsDashboard.tsx": "Dashboard for managing bookings with tabs for outgoing and incoming requests, filtering by status, sorting options, and separate sections for active bookings and history.",
  "frontend/src/pages/BookingSuccessPage.tsx": "Success confirmation page shown after a booking request is submitted, with links to view bookings or discover more laborers.",
  "frontend/src/pages/CreateBookingPage.tsx": "Form page for creating a new booking request for a specific laborer, with fields for service type, date/time, duration, and location, including extensive logging for debugging.",
  "frontend/src/pages/DiscoveryPage.tsx": "Search and browse page for finding laborers by location, displaying cards with laborer details, availability status, skills, and a 'Book Now' button for each.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, feature highlights explaining how the platform works, and call-to-action buttons that adapt based on authentication status.",
  "frontend/src/pages/ProfilePage.tsx": "Profile management page for laborers to edit their name, skills, services, location, contact info, mobile number, and availability status with form validation for 10-digit mobile numbers.",
  "frontend/src/pages/SystemHealthPage.tsx": "Diagnostic page that displays health status of authentication, backend actor, user profile, laborer profile, and bookings with detailed logging and manual refresh capability.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme for UI components (sidebar, card, chart), animations, and Inter font family.",
  "project_state.json": "Project metadata tracking a peer-to-peer labor booking marketplace with 29 versions, known issues with booking functionality after deployments, and 11 existing features including authentication, profiles, discovery, and booking management."
}