{
  "backend/main.mo": "Main actor defining the labor booking platform backend with types for Availability, Booking, Service, and Laborer, plus functions for managing laborer profiles, bookings, and user profiles with role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting two debugging features related to fixing the 'labour not found' error in CreateBookingPage.tsx by investigating laborer data fetching and adding comprehensive error logging.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose, key functionality, and implementation details for the labor booking application.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark modes with warm earth-tone palette (amber, orange, stone) and base styling for body and border elements.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with all route definitions (landing, profile, discovery, booking pages), Layout wrapper with ProfileSetupModal for new users, and Toaster for notifications.",
  "frontend/src/components/BookingHistorySection.tsx": "Collapsible section component displaying completed and cancelled bookings with toggle functionality, status badges, formatted dates, and clickable cards linking to booking detail pages.",
  "frontend/src/components/Layout.tsx": "Main layout component with responsive header navigation, Internet Identity authentication button, mobile menu toggle, and footer with LaborConnect branding and caffeine.ai attribution.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component that prompts new users to enter their name on first login, using a form with name input and submit button that calls useSaveCallerUserProfile mutation.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBookingFilters.ts": "Hook providing a filterAndSortBookings function that filters bookings by status and sorts them by date (newest or oldest).",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and providing login/logout functions with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, laborer data, and bookings from the backend actor, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including primary, secondary, accent, and sidebar color schemes.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped in QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/pages/BookingDetailPage.tsx": "Page displaying detailed booking information with editable details field for providers, showing requester/provider profiles, status badges, and formatted date/time information.",
  "frontend/src/pages/BookingsDashboard.tsx": "Dashboard page displaying incoming and outgoing bookings with filtering, sorting, and status management. Shows active bookings and history in tabs with detailed booking cards.",
  "frontend/src/pages/BookingSuccessPage.tsx": "Success confirmation page shown after booking submission with links to discover more laborers or view bookings dashboard.",
  "frontend/src/pages/CreateBookingPage.tsx": "Form page for creating new bookings with a specific laborer. Validates input fields (service type, date/time, duration, location) and submits booking requests.",
  "frontend/src/pages/DiscoveryPage.tsx": "Search page for finding laborers by location. Displays laborer cards with availability status, skills, and booking options.",
  "frontend/src/pages/LandingPage.tsx": "Marketing homepage with hero section and features overview. Shows authentication-aware CTAs for finding laborers or managing profile.",
  "frontend/src/pages/ProfilePage.tsx": "Profile management page for laborers to edit their information including name, skills, services, location, contact, and availability status.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended theme settings for borders/radius/shadows, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata for a peer-to-peer labor booking marketplace app, tracking implemented features (authentication, profiles, discovery, bookings, detailed views) and noting a known issue where the booking page displays 'labour not found' error."
}